api/tests/performance/chess-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Chess API Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">500 games x 2 players = 1000 concurrent WebSocket connections; ~1 move/s per player; total duration under 5 min</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables"
                   elementType="Arguments"
                   guiclass="ArgumentsPanel"
                   testclass="Arguments"
                   testname="User Defined Variables"
                   enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="TARGET_HOST" elementType="Argument">
            <stringProp name="Argument.name">TARGET_HOST</stringProp>
            <stringProp name="Argument.value">${__P(target_host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_PORT" elementType="Argument">
            <stringProp name="Argument.name">TARGET_PORT</stringProp>
            <stringProp name="Argument.value">${__P(target_port,5000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SCHEME" elementType="Argument">
            <stringProp name="Argument.name">SCHEME</stringProp>
            <stringProp name="Argument.value">${__P(scheme,http)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USE_TLS" elementType="Argument">
            <stringProp name="Argument.name">USE_TLS</stringProp>
            <stringProp name="Argument.value">${__P(use_tls,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="MOVE_ITERATIONS" elementType="Argument">
            <stringProp name="Argument.name">MOVE_ITERATIONS</stringProp>
            <stringProp name="Argument.value">${__P(move_iterations,100)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui"
                         testclass="ConfigTestElement"
                         testname="HTTP Request Defaults"
                         enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                     guiclass="HTTPArgumentsPanel" testclass="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">${SCHEME}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <intProp name="HTTPSampler.connect_timeout">10000</intProp>
        <intProp name="HTTPSampler.response_timeout">30000</intProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="JSON Content-Type Header" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Chess Game Load (500 games / 1000 players)"
                   enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController"
                     guiclass="LoopControlPanel"
                     testclass="LoopController"
                     testname="Loop Controller"
                     enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler"
                       testname="Init Thread Variables" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
vars.put("RS", "\u001e")
def board = '[' +
  '["bR","bN","bB","bQ","bK","bB","bN","bR"],' +
  '["bP","bP","bP","bP","bP","bP","bP","bP"],' +
  '[null,null,null,null,null,null,null,null],' +
  '[null,null,null,null,null,null,null,null],' +
  '[null,null,null,null,null,null,null,null],' +
  '[null,null,null,null,null,null,null,null],' +
  '["wP","wP","wP","wP","wP","wP","wP","wP"],' +
  '["wR","wN","wB","wQ","wK","wB","wN","wR"]' +
']'
vars.put("BOARD_SNAPSHOT", board)
SampleResult.setSuccessful(true)
SampleResult.setResponseCode("200")
SampleResult.setResponseMessage("Thread variables initialised")
          ]]></stringProp>
        </JSR223Sampler>
        <hashTree/>
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="01 - Create Players and Game"
                               enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                            testclass="HTTPSamplerProxy"
                            testname="Create Player 1 (White)"
                            enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"playerName":"white-${__threadNum}","color":"white"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/player</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui"
                            testclass="RegexExtractor"
                            testname="Extract playerId1"
                            enabled="true">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">playerId1</stringProp>
              <stringProp name="RegexExtractor.regex">"playerId":"([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">ERROR_playerId1_NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_no">1</stringProp>
            </RegexExtractor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui"
                               testclass="ResponseAssertion"
                               testname="Assert playerId1 present"
                               enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">playerId</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Player 1 creation failed</stringProp>
              <intProp name="Assertion.test_type">2</intProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                            testclass="HTTPSamplerProxy"
                            testname="Create Player 2 (Black)"
                            enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"playerName":"black-${__threadNum}","color":"black"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/player</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui"
                            testclass="RegexExtractor"
                            testname="Extract playerId2"
                            enabled="true">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">playerId2</stringProp>
              <stringProp name="RegexExtractor.regex">"playerId":"([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">ERROR_playerId2_NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_no">1</stringProp>
            </RegexExtractor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui"
                               testclass="ResponseAssertion"
                               testname="Assert playerId2 present"
                               enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">playerId</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Player 2 creation failed</stringProp>
              <intProp name="Assertion.test_type">2</intProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                            testclass="HTTPSamplerProxy"
                            testname="Create Game"
                            enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"playerId":"${playerId1}"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/game</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui"
                            testclass="RegexExtractor"
                            testname="Extract gameId"
                            enabled="true">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">gameId</stringProp>
              <stringProp name="RegexExtractor.regex">"gameId":"([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">ERROR_gameId_NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_no">1</stringProp>
            </RegexExtractor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui"
                               testclass="ResponseAssertion"
                               testname="Assert gameId present"
                               enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">gameId</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Game creation failed</stringProp>
              <intProp name="Assertion.test_type">2</intProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="02 - Connect Player 1 (SignalR)"
                               enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                            testclass="HTTPSamplerProxy"
                            testname="Negotiate P1"
                            enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/game/live/negotiate?negotiateVersion=1</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui"
                            testclass="RegexExtractor"
                            testname="Extract connectionToken1"
                            enabled="true">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">connectionToken1</stringProp>
              <stringProp name="RegexExtractor.regex">"connectionToken":"([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">ERROR_TOKEN1_NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_no">1</stringProp>
            </RegexExtractor>
            <hashTree/>
          </hashTree>
          <eu.luminis.jmeter.wssampler.OpenWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler"
              testname="WS Open P1"
              enabled="true">
            <stringProp name="serverName">${TARGET_HOST}</stringProp>
            <stringProp name="serverPort">${TARGET_PORT}</stringProp>
            <boolProp name="TLS">${USE_TLS}</boolProp>
            <stringProp name="path">/game/live?id=${connectionToken1}</stringProp>
            <stringProp name="connectionId">conn-p1</stringProp>
            <intProp name="connectTimeout">10000</intProp>
            <intProp name="readTimeout">10000</intProp>
          </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="SignalR Handshake P1"
              enabled="true">
            <stringProp name="requestData">{"protocol":"json","version":1}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">true</boolProp>
            <intProp name="readTimeout">5000</intProp>
            <stringProp name="connectionId">conn-p1</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="JoinGame P1"
              enabled="true">
            <stringProp name="requestData">{"type":1,"invocationId":"join-p1","target":"JoinGame","arguments":["${gameId}","${playerId1}"]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p1</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="03 - Connect Player 2 (SignalR)"
                               enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                            testclass="HTTPSamplerProxy"
                            testname="Negotiate P2"
                            enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/game/live/negotiate?negotiateVersion=1</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui"
                            testclass="RegexExtractor"
                            testname="Extract connectionToken2"
                            enabled="true">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">connectionToken2</stringProp>
              <stringProp name="RegexExtractor.regex">"connectionToken":"([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">ERROR_TOKEN2_NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_no">1</stringProp>
            </RegexExtractor>
            <hashTree/>
          </hashTree>
          <eu.luminis.jmeter.wssampler.OpenWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler"
              testname="WS Open P2"
              enabled="true">
            <stringProp name="serverName">${TARGET_HOST}</stringProp>
            <stringProp name="serverPort">${TARGET_PORT}</stringProp>
            <boolProp name="TLS">${USE_TLS}</boolProp>
            <stringProp name="path">/game/live?id=${connectionToken2}</stringProp>
            <stringProp name="connectionId">conn-p2</stringProp>
            <intProp name="connectTimeout">10000</intProp>
            <intProp name="readTimeout">10000</intProp>
          </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="SignalR Handshake P2"
              enabled="true">
            <stringProp name="requestData">{"protocol":"json","version":1}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">true</boolProp>
            <intProp name="readTimeout">5000</intProp>
            <stringProp name="connectionId">conn-p2</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="JoinGame P2"
              enabled="true">
            <stringProp name="requestData">{"type":1,"invocationId":"join-p2","target":"JoinGame","arguments":["${gameId}","${playerId2}"]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p2</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel"
                        testclass="LoopController"
                        testname="04 - Move Loop (100 x 2s = ~200s)"
                        enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${MOVE_ITERATIONS}</stringProp>
        </LoopController>
        <hashTree>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="P1 SendMove"
              enabled="true">
            <stringProp name="requestData">{"type":1,"target":"SendMove","arguments":["${gameId}",${BOARD_SNAPSHOT}]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p1</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree>
            <ConstantTimer guiclass="ConstantTimerGui"
                           testclass="ConstantTimer"
                           testname="1s think time (after P1 move)"
                           enabled="true">
              <stringProp name="ConstantTimer.delay">1000</stringProp>
            </ConstantTimer>
            <hashTree/>
          </hashTree>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="P2 SendMove"
              enabled="true">
            <stringProp name="requestData">{"type":1,"target":"SendMove","arguments":["${gameId}",${BOARD_SNAPSHOT}]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p2</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree>
            <ConstantTimer guiclass="ConstantTimerGui"
                           testclass="ConstantTimer"
                           testname="1s think time (after P2 move)"
                           enabled="true">
              <stringProp name="ConstantTimer.delay">1000</stringProp>
            </ConstantTimer>
            <hashTree/>
          </hashTree>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="05 - Cleanup"
                               enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="LeaveGame P1"
              enabled="true">
            <stringProp name="requestData">{"type":1,"invocationId":"leave-p1","target":"LeaveGame","arguments":["${gameId}","${playerId1}"]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p1</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.CloseWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.CloseWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.CloseWebSocketSampler"
              testname="WS Close P1"
              enabled="true">
            <stringProp name="connectionId">conn-p1</stringProp>
          </eu.luminis.jmeter.wssampler.CloseWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler"
              testname="LeaveGame P2"
              enabled="true">
            <stringProp name="requestData">{"type":1,"invocationId":"leave-p2","target":"LeaveGame","arguments":["${gameId}","${playerId2}"]}${RS}</stringProp>
            <boolProp name="isBinaryMessage">false</boolProp>
            <boolProp name="waitForResponse">false</boolProp>
            <stringProp name="connectionId">conn-p2</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
          <eu.luminis.jmeter.wssampler.CloseWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.CloseWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.CloseWebSocketSampler"
              testname="WS Close P2"
              enabled="true">
            <stringProp name="connectionId">conn-p2</stringProp>
          </eu.luminis.jmeter.wssampler.CloseWebSocketSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport"
                         testclass="ResultCollector"
                         testname="Summary Report (local only)"
                         enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>